using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace songgenre
{
    class seni : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("Ах вы, сени мои, сени,\r\nСени новые мои,\r\nСени новые кленовые,\r\nРешетчатые!\r\n\r\nКак и мне по вам, по сеничкам,\r\nНе хаживати,\r\nМне мила друга за рученьку\r\nНе важивати!");
        }
    }
    class dush : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("Ах ты, душечка, красна девица,\r\nМы пойдем с тобой, разгуляемся.\r\n\r\nМы пойдем с тобой, разгуляемся\r\nВдоль по бережку Волги-матушки.\r\n\r\nЭх, пускай на нас люди зарятся:\r\n«Ну и что ж это, что за парочка!\r\n\r\nТо не брат с сестрой, то не муж с женой,\r\nДобрый молодец с красной девицей!»");
        }
    }
    class napos : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("А напоследок я скажу:\r\nпрощай, любить не обязуйся.\r\nС ума схожу. Иль восхожу\r\nк высокой степени безумства.Как ты любил? Ты пригубил\r\nпогибели. Не в этом дело.\r\nКак ты любил? Ты погубил,\r\nно погубил так неумело.Жестокость промаха… О, нет\r\nтебе прощенья. Живо тело,\r\nи бродит, видит белый свет,\r\nно тело мое опустело.Работу малую висок\r\nеще вершит. Но пали руки,\r\nи стайкою, наискосок,\r\nуходят запахи и звуки.");
        }
    }
    class glaza : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("Ах, эти черные глаза\r\nМеня пленили.\r\nИх позабыть нигде нельзя —\r\nОни горят передо мной.\r\nАх, эти черные глаза\r\nМеня любили.\r\nКуда же скрылись вы теперь,\r\nКто близок вам другой?\r\n\r\nБыл день весенний. Всё, расцветая, ликовало.\r\nСирень синела, будя уснувшие мечты.\r\nСлезы ты безутешно проливала.\r\nТы не любила, и со мной прощалась ты.");
        }
    }
    class roz : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("В те дни, когда роились грезы\r\nВ сердцах людей, прозрачны и ясны,\r\nКак хороши, как свежи были розы\r\nМоей прекрасной, голубой страны.\r\n\r\nПрошли лета и всюду льются слезы,\r\nНет ни страны, ни тех, кто жил в стране.\r\nКак хороши, как свежи были розы\r\nВоспоминаний о минувшем дне.\r\n\r\n  https://pesni.guru");
        }
    }
    class zar : isonggenre
    {
        public void GetMusic()
        {
            Console.WriteLine("На заре ты ее не буди,\r\nНа заре она сладко так спит;\r\nУтро дышит у ней на груди,\r\nЯрко пышет на ямках ланит.\r\nИ подушка ее горяча,\r\nИ горяч утомительный сон,\r\nИ, чернеясь, бегут на плеча\r\nКосы лентой с обеих сторон.\r\n\r\nА вчера у окна ввечеру\r\nДолго, долго сидела она\r\nИ следила по тучам игру,\r\nЧто скользя затевала луна.\r\nИ чем ярче играла луна,\r\nИ чем громче свистал соловей,\r\nВсе бледней становилась она,\r\nСердце билось больней и больней.\r\n\r\n\r\n  https://pesni.guru");
        }
    }
}